openfoam_container/simulation/fene_p/contraction/template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.0032;

vertices
(
    (0 -4 0) // 0
    (80 -4 0) // 1
    (0 -1 0) // 2
    (80 -1 0) // 3
    (0 1 0) // 4
    (80 1 0) // 5
    (0 4 0) // 6
    (80 4 0) // 7
    (130 -1 0) // 8
    (130 1 0) // 9
    (0 -4 0.1) // 10
    (80 -4 0.1) // 11
    (0 -1 0.1) // 12
    (80 -1 0.1) // 13
    (0 1 0.1) // 14 
    (80 1 0.1) // 15
    (0 4 0.1) // 16
    (80 4 0.1) // 17
    (130 -1 0.1) // 18 
    (130 1 0.1) // 19
);

blocks
(

    hex (0 1 3 2 10 11 13 12) (300 45 1) simpleGrading (0.1 1 1)
    hex (2 3 5 4 12 13 15 14) (300 30 1) simpleGrading (0.1 1 1)
    hex (4 5 7 6 14 15 17 16) (300 45 1) simpleGrading (0.1 1 1)
    hex (3 8 9 5 13 18 19 15) (180 30 1) simpleGrading (10 1 1)

);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (0 10 12 2)
            (2 12 14 4)
            (4 14 16 6)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (6 16 17 7)
            (5 7 17 15)
            (3 13 18 8)
            (5 15 19 9)
            (1 3 13 11)
            (0 10 11 1)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (8 9 19 18)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 2 3 1)
            (2 4 5 3)
            (4 6 7 5)
            (3 5 9 8)
            (10 11 13 12)
            (12 13 15 14)
            (14 15 17 16)
            (13 18 19 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
