openfoam_container/simulation/fene_p/contraction/template/system/fvSchemes2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         CrankNicolson 0.7;
}

gradSchemes
{
    default         cellMDLimited Gauss linear 0;
    grad(p)         cellMDLimited Gauss linear 0;
    grad(U)         cellMDLimited Gauss linear 0.333;

}

divSchemes
{
    default                  none;
    div(phi,U)               Gauss limitedLinear 1;
    div(phi,tau)             Gauss limitedLinear 1;
    div(tau)                 Gauss limitedLinear 1;
}

laplacianSchemes
{
    default                      none;
    laplacian(etaPEff,U)         Gauss linear limited 1;
    laplacian(etaPEff+etaS,U)    Gauss linear limited 1;
    laplacian((1|A(U)),p)        Gauss linear limited 1;
}

interpolationSchemes
{
    default           linear;
    interpolate(HbyA) linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
