openfoam_container/simulation/fene_p/contraction/template/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.001;
        smoother         symGaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }

    U
    {
        solver           BiCGStab;
        preconditioner   DILU;

        tolerance         1e-6;
        relTol            0.01;
        minIter           0;
        maxIter           1000;
    }

    tau
    {
        solver           BiCGStab;
        preconditioner   DILU;

        tolerance         1e-6;
        relTol            0.01;
        minIter           0;
        maxIter           1000;

    }
}

potentialFlow
{
    nNonOrthogonalCorrectors  3;
}

PISO
{
    nCorrectors    2;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    p               0.3;
    U               0.7;
    tau             0.5;
}

// ************************************************************************* //
